# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

arr = [2, 3, 4, 5, 6]
rez = []
for i in range(len(arr)//2):
    rez.append(arr[i]*arr[-i-1])
if len(arr) % 2 != 0:
    rez.append(arr[len(arr)//2]**2)
print("Произведения пар чисел списка:", rez)